## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: deploy/dev/eu-west-1/infrastructure/vpc
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all             = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc                  = true
    }

  # aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id        = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all             = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all         = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all         = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all                                       = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all                                       = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all                                       = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all                                       = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all                                       = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.103.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all                                       = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       assign_generated_ipv6_cidr_block     = false
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
+       tags_all                             = {
+           "Contact"     = "marcus.tse"
+           "Environment" = "Development"
+           "Name"        = "Terragrunt-VPC"
+           "Owner"       = "Marcus"
+           "Project"     = "Terragrunt Medium"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   azs                                         = [
+       "eu-west-1a",
+       "eu-west-1b",
+       "eu-west-1c",
    ]
+   cgw_arns                                    = []
+   cgw_ids                                     = []
+   database_nat_gateway_route_ids              = []
+   database_route_table_association_ids        = []
+   database_route_table_ids                    = [
+       (known after apply),
    ]
+   database_subnet_arns                        = []
+   database_subnets                            = []
+   database_subnets_cidr_blocks                = []
+   database_subnets_ipv6_cidr_blocks           = []
+   default_network_acl_id                      = (known after apply)
+   default_route_table_id                      = (known after apply)
+   default_security_group_id                   = (known after apply)
+   elasticache_route_table_association_ids     = []
+   elasticache_route_table_ids                 = [
+       (known after apply),
    ]
+   elasticache_subnet_arns                     = []
+   elasticache_subnets                         = []
+   elasticache_subnets_cidr_blocks             = []
+   elasticache_subnets_ipv6_cidr_blocks        = []
+   igw_arn                                     = (known after apply)
+   igw_id                                      = (known after apply)
+   intra_route_table_association_ids           = []
+   intra_route_table_ids                       = []
+   intra_subnet_arns                           = []
+   intra_subnets                               = []
+   intra_subnets_cidr_blocks                   = []
+   intra_subnets_ipv6_cidr_blocks              = []
+   name                                        = "Main"
+   nat_ids                                     = [
+       (known after apply),
    ]
+   nat_public_ips                              = [
+       (known after apply),
    ]
+   natgw_ids                                   = [
+       (known after apply),
    ]
+   outpost_subnet_arns                         = []
+   outpost_subnets                             = []
+   outpost_subnets_cidr_blocks                 = []
+   outpost_subnets_ipv6_cidr_blocks            = []
+   private_ipv6_egress_route_ids               = []
+   private_nat_gateway_route_ids               = [
+       (known after apply),
    ]
+   private_route_table_association_ids         = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_route_table_ids                     = [
+       (known after apply),
    ]
+   private_subnet_arns                         = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets                             = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets_cidr_blocks                 = [
+       "10.0.1.0/24",
+       "10.0.2.0/24",
+       "10.0.3.0/24",
    ]
+   private_subnets_ipv6_cidr_blocks            = [
+       null,
+       null,
+       null,
    ]
+   public_internet_gateway_route_id            = (known after apply)
+   public_route_table_association_ids          = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_route_table_ids                      = [
+       (known after apply),
    ]
+   public_subnet_arns                          = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets                              = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets_cidr_blocks                  = [
+       "10.0.101.0/24",
+       "10.0.102.0/24",
+       "10.0.103.0/24",
    ]
+   public_subnets_ipv6_cidr_blocks             = [
+       null,
+       null,
+       null,
    ]
+   redshift_public_route_table_association_ids = []
+   redshift_route_table_association_ids        = []
+   redshift_route_table_ids                    = [
+       (known after apply),
    ]
+   redshift_subnet_arns                        = []
+   redshift_subnets                            = []
+   redshift_subnets_cidr_blocks                = []
+   redshift_subnets_ipv6_cidr_blocks           = []
+   this_customer_gateway                       = {}
+   vpc_arn                                     = (known after apply)
+   vpc_cidr_block                              = "10.0.0.0/16"
+   vpc_enable_dns_hostnames                    = true
+   vpc_enable_dns_support                      = true
+   vpc_flow_log_destination_type               = "cloud-watch-logs"
+   vpc_id                                      = (known after apply)
+   vpc_instance_tenancy                        = "default"
+   vpc_ipv6_association_id                     = (known after apply)
+   vpc_ipv6_cidr_block                         = (known after apply)
+   vpc_main_route_table_id                     = (known after apply)
+   vpc_owner_id                                = (known after apply)
+   vpc_secondary_cidr_blocks                   = []

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:deploy/dev/eu-west-1/infrastructure/vpc workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
